// Day0012,函数分文件写法,重建归档项目
#include <iostream>
#include "SortTest.h"
// 此处的#include命令是指在编译前将后续所声明的文件内容粘贴到此处,而非链接某个库
// <>尖括号表示需要去编译器标准库或系统中寻找所声明文件,""双引号则表示在当前项目目录中寻找
// 盲目include庞大的库会造成编译速度下降,名称冲突等情况,推荐遵守最小包含原则

using namespace std;

int main()
{
	// 函数分文件写法步骤:
	// 创建.h后缀的头文件,创建与头文件同名的实现文件(后缀为.cpp),在主函数main前包含后进行调用
	// 函数分文件写法中一组头文件和实现文件经常包含同类型功能函数的声明及定义,按功能分类比每个函数一组头文件实现文件更利于管理
		// 分文件写法初次尝试
	cout << "调用分文件写法冒泡排序函数测试:" << '\n';

	// 获取键盘输入
	cout << "请输入待升序排序的整数个数:";
	int n = 0;
	cin >> n;

	// 初始化数组
	int arr1[100];

	// 获取输入的整数并输出获取的整数
	cout << "请输入" << n << "个整数:";
	for (int i = 0; i < n; ++i)
	{
		cin >> arr1[i];
	}

	cout << '\n' << "排序前数据的顺序为:";
	for (int i = 0; i < n; ++i)
	{
		cout << arr1[i] << ' ';
	}

	// 调用分文件写法的冒泡排序函数
	bubbleSort(arr1, n);// 传入参数是数组时无需携带数组长度信息,如这里的arr1[100]
	cout << '\n' << "测试结束" <<'\n';

	cout << '\n';

	system("pause");

	return 0;
}