// Day0013,指针定义
#include <iostream>
#include <string>

using namespace std;

void bad(int* p) 
{
	p = nullptr;
}

int main()
{
// 指针(point):创建实体时根据数据类型分配内存,内存编号即地址,可以通过地址访问内存中的数据,而指针指向数据地址
	int a = 1000;
	// 为数据创建指针:目标数据类型* 指针变量名;
	int* p1;
	// 让指针记录目标变量的地址:指针变量名 = &目标变量名;
	p1 = &a;
	// 打印指针地址
	cout << "变量a的地址为:" << &a << '\n';
	cout << "指针p内容为:" << p1 << '\n';
	// 使用指针(解引用)可以直接访问或修改地址所存储的数据:*指针变量名
	cout << "p指针地址所指向的内存,其中数据为:" << *p1 << '\n';
	*p1 = 100;
	cout << "使用*p修改指针内存中数据为100后,a的值为: " << a << '\n';
	
	// 指针作为一种数据类型,其所占的内存大小为8字节(64位操作系统中),与指针所记录的数据类型无关
	string str1 = "string";
	string* p2 = &str1;
	cout << "记录整型数据的指针p1所占内存大小为:" << sizeof(p1) << "字节" << '\n';
	cout << "记录字符串类型的指针p2所占内存大小为:" << sizeof(p2) << "字节" << '\n';

	// 创建空指针,用于指向内存编号为0的空间,无法解引用
	int* p3 = nullptr;
	// 野指针:指向未知地址的指针,会导致未知的随机内存被访问或被修改,必须避免
	
	// 指针常量、常量指针、const既修饰指针又修饰常量
	// 指针常量：const修饰常量，指针所指向的数据值不可更改，但指针指向的方向可以更改
		// int* const p = &a;
	// 常量指针：const修饰指针，指针所指向的数据可更改，但指针所指向的方向不可更改
		// const int* p = &a;
	// const既修饰指针又修饰常量，指针所指向的方向、所指向的数据都不可更改
		// const int* const p = &a;

// 数组的实现原理：数组中的数据存储在连续的、等大的内存中，数组依靠指针实现，由 首地址+偏移量*该数据类型内存大小 = 当前地址
	// 数组名在大多数时候语法下会直接退化为指针代表该数组的首地址而非整个数组的数据
	// 不退化情况如：sizeof(arr)此处会得到整个数组的大小，&arr会指向整个数组的指针，数值上等于arr但数据类型不同

// 利用指针遍历数组
	cout << '\n' << "利用指针遍历数组arr1测试:" << '\n';
	int arr1[] = { 19,42,52,65 };
	// 在定义阶段*没有解引用的作用，仅是类型声明的一部分
	int* p4 = arr1;

	cout << "数组arr1中的数据为：";
	for (int i = 0; i < 4; ++i)
	{
		// ++这类递增递减运算符更接近于前进后退一个单位，而非单单在数值上加减1，对数字而言单位一是1，对指针而言单位一是一个元素
		// 在此处对指针p4进行+i就是得到下i个数组元素，底层上是p4当前地址+i个int(i个4字节）
		// 故定义指针时需要声明指针的数据类型，且需要和指针目标对象的数据类型保持一致
		cout << *(p4 + i) << ' ';
		// 此处不推荐使用++p来遍历，学习到指针后应养成领域内产生的影响在领域外就自动销毁的习惯
	}
	cout << '\n' << "测试结束" << '\n';

// 指针与函数值传递：
	// 函数值传递通过拷贝的形式完成，程序运行调用函数时给每个函数分配一个栈帧，栈帧负责存储形参+局部变量
	// 局部变量和形参（形参是指针类型也不例外）也分配了独立内存空间，故实参和形参都是独立且存在的不同个体
	// 传入参数时将实参拷贝一份数值传入形参，调用函数则是访问、修改临时变量和形参，函数完毕后销毁栈帧以及栈帧中的形参和局部变量
	// 传入指针后能修改函数外数值是因为地址具有唯一性，指针作为实参传入函数后也会拷贝一份独立、不同的指针作为形参
		// 指针作为实参传入函数后也被拷贝
	cout << "指针作为实参传入函数内拷贝测试：" << '\n';
	int b = 5;
	int* pb = &b;

	bad(pb);

	cout << '\n' << "在bad函数内将形参p变为空指针后实参指针pb为：" << pb << '\n';
	cout << "测试结束" << '\n';

	cout << '\n';

	// 值得注意:函数内的局部变量对函数外的同名变量具有遮蔽效应

	system("pause");

	return 0;
}