// Day0008,一维数组定义
#include <iostream>
#include <string>

using namespace std;

int main()
{
	// 一维数组：数组内的所有数据为相同的数据类型，且所有数据存放在连续的内存空间
		// 定义数组方式一：数组内数据类型 数组名[数组长度]
	int arr1[3];
	// 数组内靠数据下标索引数据，下标索引从零开始计数
	arr1[0] = 10;
	arr1[1] = 20;
	arr1[2] = 30;// 用下标索引查询数组数据并赋值
	cout << "数组arr1中下标为0的数据为：" << arr1[0] << '\n';

	// 定义数组方式二：数组内数据类型 数组名[数组长度] = {数值1,数值2,······};
	int arr2[5] = { 40,50,60 };// 初始化数组时未全部赋值，则未赋值的数据空位自动补全为0
	cout << "数组arr2中下标为0的数据为：" << arr2[0] << '\n';

	// 定义数组方式三：数组内数据类型 数组名[] = {数值1,数值2,······};
	int arr3[] = { 70,80,90 };
	cout << "数组arr3中下标为0的数据为：" << arr3[0] << '\n';

	// 定义数组方式只在定义阶段使用，不能用于定义后修改数组长度或批量修改数组内数据
	arr3[0] = 0;
	cout << "数组arr3下标为0的数据再赋值后值为：" << arr3[0] << '\n';

	// 用for循环输出列表内的数据:想循环输出多个数组应该用二维数组
	cout << '\n' << "for循环输出列表数据测试：" << '\n';
	cout << "数组arr1中数据为：" << '\n';

	for (int num1 = 0; num1 < 3; ++num1)
	{
		cout << arr1[num1] << '\n';
	}

	cout << "测试结束" << '\n';

	// 整个数组所占内存大小以及数组首地址，不同类型的数据数组会分配不同大小的内存大小
		// 数组中用 首地址+i*数据所占内存大小 = arr[i]的地址 来实现索引访问，故数组只能存储相同类型数据
	cout << '\n' << "内存大小及首地址查询测试:" << '\n' << "整个数组arr1所占内存空间大小：" << sizeof(arr1) << '\n';
	cout << "整个数组arr2所占内存空间大小：" << sizeof(arr2) << '\n';
	// 数组首地址查询
	cout << "数组arr1首地址查询：" << '\n';// 整个数组首地址查询
	cout << "arr1首地址为：" << arr1 << '\n';
	// 数组中单个数据的首地址用"&数组名[下标]"查询
	cout << "数组arr1第一个数据的首地址为：" << (int)&arr1[0] << '\n';// 首地址默认以十六进制表示，用(int)转为十进制
	cout << "数组arr1第二个数据的首地址为：" << (int)&arr1[1] << '\n' << "测试结束" << '\n';

	// for循环获取非负整数数组中最大值
	int arr4[] = { 100,200,300,400,434,252,542,2 };
	int max = 0;

	cout << '\n' << "for循环获取数组最大值测试：" << '\n';

	for (int num2 = 0; num2 <= 7; ++num2)
	{
		if (arr4[num2] > max)
		{
			max = arr4[num2];
		}
	}

	cout << "数组arr4中最大值为：" << max << '\n' << "测试结束" << '\n';// 数组arr4中最大值为542

	cout << '\n';

	system("pause");

	return 0;
}