// Day0020,内存分区模型，new和delete
#include <iostream>
#include <string>
#include <vector>
// 智能指针
#include <memory>


using namespace std;

// 返回局部变量指针p的函数
int* FuncA()
{
	// new int(10)这段代码会在堆区创建一个类型为int值为10的匿名对象（有名字、类型、值→变量，无名字、有类型、值→匿名对象）
	// new int(10)的返回值是堆区中该匿名对象的地址，仅能用能装得下int*(随数据类型改变)的类型接收，此处省略详细说明
	int* p{ new int(10) };
	return p;
}

int main()
{
	// ========== 内存分区模型 ==========
	{
		// c++代码编译后，生产可执行程序，在程序运行前，分为两个区域
			// 代码区：存放CPU执行的机器指令
			// 代码区是共享的，这能使一些需多次运行的程序仅在内存中有一份代码即可
			// 代码区是只读的，防止程序以外修改它的指令
			// 全局区：存放静态变量、全局变量、常量（例如字符串常量,由""包含的内容就可称为字符串常量）

		// c++程序在运行时，内存大致分为四部分
			// 代码区：存放二进制代码，由操作系统管理
			// 全局区：存放全局变量、静态变量、常量，该区在程序结束后由操作系统释放
			// 栈区：存放函数的参数值、局部变量，由编译器自动分配释放
			// 堆区：由程序员分配、释放，若未释放则在程序结束时由操作系统回收

		// c++程序在运行后
			// 栈区相关注意事项：程序运行后，函数被调用完毕编译器会回收该函数对应栈区所属内存，故不要返回该函数内局部变量的地址
			// 很显然使用函数时返回函数内局部变量是常见操作，但返回局部变量的地址是非法操作
			// 例如：
			// void example ()
			// {
			//    int a{};
			//    return &a;
			// }
	}

	// ========== new关键字 ==========
	{
		// 栈区的局部变量在函数结束调用后被回收，用new在堆区上，就能实现函数中合法返回局部变量地址
			// new语法：new 目标变量类型(目标变量数据)，该表达式会返回指针
		cout << "利用new合法返回函数内局部变量地址测试:" << '\n';

		int* ptr_a{ FuncA() };
		// 即使不使用new，第一次访问函数非法返回的局部变量地址时编译器也会返回正确的地址，但这仍应该视为是非法操作
		cout << "局部变量指针p所存储的地址内容为:" << ptr_a << '\n';
		// 如不使用new，第二次访问局部变量返回的地址则不会得到正确结果
		cout << "局部变量指针p所存储的地址内容为:" << ptr_a << '\n';

		// 堆区的数据由程序员创建、释放，释放使用delete关键字进行
		// detele的作用对象必须是地址或者说指针这类数据类型，且不会针对接收的地址是否是new创建的地址进行检查
		// 对不是new创建的地址进行delete是非法操作，运行时会出错
		delete ptr_a;
		// 对new创建的地址进行delete后，堆区的内存空间中属于10的会被马上用于下一次写入值，不会经行归零处理
		// delete后ptr_a中的地址和其所指向的堆区内存进行解绑，但不会对指针ptr_a这个变量本身进行归零
		// ptr_a还记录着该地址，该地址仍指向原来堆区的那块内存，但此时这块内存无主无权访问
		// 需要对指针ptr_a进行归零防止非法访问，故delete和指针归零强绑定以防止悬空指针出现
		ptr_a = nullptr;
		// 即使没有对指针prt_a进行归零，仍可以cout输出，此时仅是打印该指针地址而非解引用访问地址所指向的内容
		cout << ptr_a << '\n';

		cout << "测试结束" << '\n' << '\n';
	}

	// ========== 智能指针 ==========
	{
		// 智能指针在出它的作用于后会自动delete以及指针记录归零
		cout << "智能指针测试:" << '\n';

		// unique_ptr<int> 读作"独占一个int所有权的智能指针"，其内部包着堆区地址
		// 花括号内std::make_unique<int>(20)是创建堆区int(值20)并返回包好它的unique_ptr
		std::unique_ptr<int> ptr_b{ std::make_unique<int>(20) };
		cout << "使用智能指针创建指针ptr_b，其值为:" << *ptr_b << '\n'; // 输出20

		cout << "测试结束" << '\n';
	}
	return 0;
}