// Day0003，布尔型，cin，运算符
#include <iostream>
#include <string>

using namespace std;

int main()
{
	// 布尔型：用false（0）和true（1）来存储数据
		// 语法：bool 变量名 = false;或 = true;
	bool flag1 = true;// bool型所占内存大小为1字节
	cout << "bool型所占内存大小为" << sizeof(flag1) << "字节" << "\n";
	// 为bool型变量赋值时除了0以外的值都视为1
	bool flag2 = "example1";
	cout << "以字符串为bool赋值，bool值为" << flag2 << "\n";

	// cin获取键盘输入：cin >> 变量; 可为变量重新赋值
	string str1 = "example2";
	cout << "为str1赋值：\n";
	cin >> str1;
	cout << "赋值后str1等于：" << str1 << "\n";

	//	运算符：可分为算术、赋值、比较、逻辑
		// 算术运算符：+加 -减 *乘 /除 %取余 ++--前后置递增减
	int num1 = 10;
	int num2 = 3;
	cout << "整数除法测试：" << num1 / num2 << "\n";// cpp中整型除整型只能得到整型

	// 前置递增：前置目标变量经过递增+1后，返回新值
	int num3 = 11;
	cout << "前置递增测试：" << ++num3 * 10 << "\n";// num3+1后*10，num3为12，运算结果为120
	// 后置递增：后置目标变量经过递增+1后，返回旧值
	int num4 = 11;
	cout << "后置递增测试：" << num4++ * 10 << "\n";// num4*10后，num4+1，num4为12，运算结果为110

	// 赋值运算符：=等于 +=加等于 -=减等于 *=乘等于 /=除等于 %=余等于
		// 示例：a *= 2 等价于 a = a*2，其余同理
	int num5 = 9;
	num5 *= 9;// 等价于num5 = num5 * 9;
	cout << "乘等于测试：" << num5 << '\n';// 赋值运算符优先级小于<<，可用括号辅助输出，但推荐先赋值后再输出

	// 比较运算符：==判断等于 !=判断不等于 >大于 <小于 >=大于等于 <=小于等于
		// 比较运算符默认输出0或1，比较运算符优先级低于<<，简易比较可以在cout里用()辅助输出
	cout << "==运算测试：" << (num4 == num5) << '\n';// 比较不成立，输出0

	// 逻辑运算符：！非 &&与 ||或，从左到右优先级递减，优先级低于<<，复杂逻辑运算时不推荐直接写入cout内
		// ！非，对数据的真假值取反
	int num6 = 10;
	cout << "非运算测试：" << !!num6 << '\n';// num6不为0，bool值为1，两次取反后bool值为1
	// &&与，当a&&b，仅ab同真时运算结果为真，否则为假；
	cout << "&&运算测试：" << (num5 && num6) << '\n';//num5与num6同真，运算结果为1
	// ||或，当a||b，仅ab同假时运算结果为假，否则为真
	int num7 = 0;
	cout << "||运算测试：" << (num6 || num7) << '\n';//num6与num7不同假，运算结果为1

	system("pause");

	return 0;
}