// Day0004,程序流程结构_选择结构if语句，三目运算符
#include <iostream>
#include <string>

using namespace std;

int main()
{
	// 程序流程结构：顺序（按顺序执行）、选择（选择性地执行条件满足的程序）、循环（依据条件是否满足，循环多次执行程序）
		// 选择结构简单if语句（单行if语句）；
		/*语法：
			if(条件)
			{
				满足条件时执行的语句
			}
		*/
		// 判断输入并输出测试：获取输入，输入的整数大于9执行if语句，否则不执行语句
	int num1 = 0;
	cout << "输入大于9的整数：" << '\n';
	cin >> num1;
	if (num1 > 9) //此处后不能有分号";"
	{
		cout << "单行if测试无误" << '\n';
	}

	// 选择结构多行if语句；
	/*语法：
		if(条件)
		{
			满足条件时执行的语句
		}
		else
		{
			不满足条件时执行的语句
		}
	*/
	// 未满足条件优化：获取输入，输入的整数大于8执行if，否则执行else
	int num2 = 0;
	cout << "输入大于8的整数：" << '\n';
	cin >> num2;
	if (num2 > 8)
	{
		cout << "输入的整数大于8，多行if测试无误" << '\n';
	}
	else
	{
		cout << "输入的整数小于8，else测试无误" << '\n';
	}

	// 选择结构多条件if语句
	/*语法：
		if(条件1）
		{
			满足条件1时执行的语句
		}
		else if(条件2)
		{
			满足条件2时执行的语句
		}
		else
		{
			不满足所有条件时执行的语句
		}
	*/
	// 多条件以及嵌套if测试：猜固定数字7，两次机会
	int guess_num = 7;// 固定数字7
	int cin_num = 0;// 输入数字初始化
	cout << "猜一个十以内的整数，两次机会：" << '\n';
	cin >> cin_num;
	if (cin_num == guess_num)
	{
		cout << "第一次就猜对了" << '\n';
	}
	else if (cin_num != guess_num)
	{
		cout << "猜错了，再来一次：" << '\n';
		cin >> cin_num;// 第一次猜错后获取第二次输入
		//if嵌套，在第一次猜错的情况下进行第二次判断输入整数是否等于7
		if (cin_num == guess_num)
		{
			cout << "第二次猜对了" << '\n';
		}
		else
		{
			cout << "第二次也猜错了" << '\n';
		}
	}

	// 三目运算符：表达式1 ? 表达式2 : 表达式3;
	// 表达式1为真值时，执行表达式2并返回表达式2的结果，表达式1为假值时，执行表达式3并返回表达式3的结果
		// 当返回的表达式内容是变量时也可给继续给该变量再赋值，也可将返回值直接赋值给其他变量
		// 比较两个输入的整数大小并将大的值赋值给其他变量
	int num3 = 0;
	int num4 = 0;
	int num5 = 0;
	cout << "三目运算符比较，依次输入两个不同整数:" << '\n';
	cin >> num3;
	cin >> num4;
	// 当num3大于num4时返回num3，否则返回num4
	num5 = (num3 > num4 ? num3 : num4);// 三目运算符优先级小于赋值=，左=位置的变量用于接受三目运算符返回值
	cout << "数值较大的为：" << num5 << '\n';

	// 比较两个输入的整数，将大的整数再赋值
	int num6 = 0;
	int num7 = 0;
	int num8 = 0;
	cout << "三目运算符比较后再赋值，依次输入两个不同的整数：" << '\n';
	cin >> num6;
	cin >> num7;
	cout << "其中数值较大的为：" << (num6 > num7 ? num6 : num7) << '\n';
	num8 = ((num6 > num7 ? num6 : num7) = 70);// 右=位置可以为返回表达式的变量进行再赋值
	cout << "将数值较大的再赋值为：" << num8 << '\n';

	return 0;

}